In [2]:
import sqlite3

In [17]:
# 1) Criar conexão;
conn = sqlite3.connect('exemplo_sala.db')

# 2) Criar um cursor;
cursor = conn.cursor()

# 3) executar minha operação qualquer;

sql = """
    CREATE TABLE IF NOT EXISTS alunos (
    id_aluno integer primary key ,
    nome_aluno varchar(200) not null,
    idade integer default 18
    );

"""

cursor.execute(sql)

cursor.execute("insert into alunos ( nome_aluno, idade) values ('Ana', 20);")
cursor.execute("insert into alunos (nome_aluno, idade) values ('Bruno', 22);")
cursor.execute("insert into alunos (nome_aluno) values ('Carla');")

cursor.execute("select * from alunos;")

print(cursor.fetchall())

# 4) confirmar a operação (commit);
conn.commit()

# 5) fechar a conexão;
conn.close()

[(1, 'Ana', 20), (2, 'Bruno', 22), (3, 'Carla', 18), (4, 'Ana', 20), (5, 'Bruno', 22), (6, 'Carla', 18)]

In [33]:
conn = sqlite3.connect('exemplo_sala.db')
cursor = conn.cursor()

dados = cursor.execute("select * from alunos;")
print(dados)

for linha in dados.fetchall():
    print(linha)

conn.close()

<sqlite3.Cursor object at 0x000001B23988B940>
(1, 'Ana', 20)
(2, 'Bruno', 22)
(3, 'Carla', 18)
(4, 'Ana', 20)
(5, 'Bruno', 22)
(6, 'Carla', 18)

In [27]:
conn = sqlite3.connect('exemplo_sala.db')
cursor = conn.cursor()

dados = cursor.execute("select * from alunos;")

while dados is not None:
    print(dados)
    dados = cursor.fetchone()

conn.close()

<sqlite3.Cursor object at 0x000001B23988A340>
(1, 'Ana', 20)
(2, 'Bruno', 22)
(3, 'Carla', 18)
(4, 'Ana', 20)
(5, 'Bruno', 22)
(6, 'Carla', 18)

In [46]:
conexao = sqlite3.connect('exemplo_sala.db')

with conexao:
    cursor = conexao.cursor()
    cursor.execute("insert into alunos (nome_aluno, idade) values ('Daniel', 19);")
    cursor.execute("insert into alunos (nome_aluno, idade) values ('Eduarda', 21);")
    cursor.execute("insert into alunos (nome_aluno) values ('Fabio');")

    dados = cursor.execute("select * from alunos;")
    for linha in dados.fetchall():
        print(linha)

(1, 'Ana', 20)
(2, 'Bruno', 22)
(3, 'Carla', 18)
(4, 'Ana', 20)
(5, 'Bruno', 22)
(6, 'Carla', 18)
(7, 'Daniel', 19)
(8, 'Eduarda', 21)
(9, 'Fabio', 18)
(10, 'Gustavo', 23)
(11, 'Helena', 20)
(12, 'Igor', 18)
(13, 'Daniel', 19)
(14, 'Eduarda', 21)
(15, 'Fabio', 18)

ProgrammingError: Cannot operate on a closed database.

In [48]:
conexao.close()

In [37]:
conexao = sqlite3.connect('exemplo_sala.db')
cursor = conexao.cursor()

try:
    cursor.execute("insert into alunos (nome_aluno, idade) values ('Gustavo', 23);")
    cursor.execute("insert into alunos (nome_aluno, idade) values ('Helena', 20);")
    cursor.execute("insert into alunos (nome_aluno) values ('Igor');")

    dados = cursor.execute("select * from alunos;")
    for linha in dados.fetchall():
        print(linha)

    conexao.commit()

except Exception as e:
    print('Erro ao inserir dados: ', e)
    conexao.rollback()

finally:
    conexao.close()

(1, 'Ana', 20)
(2, 'Bruno', 22)
(3, 'Carla', 18)
(4, 'Ana', 20)
(5, 'Bruno', 22)
(6, 'Carla', 18)
(7, 'Daniel', 19)
(8, 'Eduarda', 21)
(9, 'Fabio', 18)
(10, 'Gustavo', 23)
(11, 'Helena', 20)
(12, 'Igor', 18)

In [52]:
def retorna_conexao_banco_de_dados(nome_banco):
    return sqlite3.connect(nome_banco)

In [53]:
with retorna_conexao_banco_de_dados('exemplo_sala.db') as conexao:
    dados = conexao.cursor().execute("select * from alunos;").fetchall()
    for linha in dados:
        print(linha)

(1, 'Ana', 20)
(2, 'Bruno', 22)
(3, 'Carla', 18)
(4, 'Ana', 20)
(5, 'Bruno', 22)
(6, 'Carla', 18)
(7, 'Daniel', 19)
(8, 'Eduarda', 21)
(9, 'Fabio', 18)
(10, 'Gustavo', 23)
(11, 'Helena', 20)
(12, 'Igor', 18)

In [51]:

conexao.cursor().execute("select * from alunos;").fetchall()

[(1, 'Ana', 20),
 (2, 'Bruno', 22),
 (3, 'Carla', 18),
 (4, 'Ana', 20),
 (5, 'Bruno', 22),
 (6, 'Carla', 18),
 (7, 'Daniel', 19),
 (8, 'Eduarda', 21),
 (9, 'Fabio', 18),
 (10, 'Gustavo', 23),
 (11, 'Helena', 20),
 (12, 'Igor', 18)]